app/controllers/clientes_controller.rb

  def create
    @cliente = Cliente.new(cliente_params)

    if @cliente.save
---
INSERT INTO "clientes" ("nome", "num_conta", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["nome", "Fabrício"], ["num_conta", "342"], ["created_at", "2023-09-11 18:51:01.079254"], ["updated_at", "2023-09-11 18:51:01.079254"]]